# cask_args appdir: '~/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'domt4/autoupdate'
tap 'phinze/cask'
# tap' mas-cli/tap'

brew 'ack'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'curl'
brew 'diff-so-fancy'
brew 'dnscrypt-proxy', restart_service: true, link: false
brew 'dockutil'
brew 'findutils'
brew 'fish'
brew 'gist'
brew 'git'
brew 'git-crypt'
brew 'git-flow'
brew 'git-lfs'
brew 'git-quick-stats'
brew 'git-secrets'
brew 'gitmoji'
brew 'gnupg'
brew 'go'
brew 'grep'
brew 'htop'
brew 'hub'
brew 'imagemagick'
brew 'jupyter'
brew 'libksba'
brew 'librsvg'
brew 'mas'
brew 'maven'
brew 'neovim'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'pigz'
brew 'pkg-config'
brew 'python'
brew 'python@2'
brew 'rbenv-default-gems'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'rhino'
brew 'ruby'
brew 'smimesign'
brew 'speedtest-cli'
brew 'stubby'
brew 'terminal-notifier'
brew 'thefuck'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watchman'
brew 'webkit2png'
brew 'wget'
brew 'wifi-password'
brew 'yarn', args: ["ignore-dependencies"]
brew 'zopfli'

cask '1password'
cask 'abstract'
cask 'atom'
cask 'bartender'
cask 'cleanmymac'
cask 'diffmerge'
cask 'dropbox'
cask 'endurance'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'iina'
cask 'istat-menus'
cask 'iterm2'
cask 'itsycal'
cask 'kitty'
cask 'ksdiff'
cask 'micro-snitch'
cask 'postman'
cask 'rocket'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'tower'
cask 'transmission'
cask 'tripmode'
cask 'visual-studio-code'
cask 'zeplin'
cask 'zoomus'

# software for home computers.
# cask 'avast-security'
# cask 'battle-net'
# cask 'filebot'
# cask 'nordvpn'
# cask 'plex-media-server'
# cask 'steam'

# fonts.
cask 'font-droid-sans-mono-for-powerline'
cask 'font-fira-code'
cask 'font-langdon'
cask 'font-meslo-nerd-font'
cask 'font-museo'
cask 'font-open-sans'

# quicklook.
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# app store.
# mas 'Clear', id: 504544917
# mas 'Fantastical', id: 975937182
# mas 'Kaleidoscope', id: 587512244
# mas 'Magnet', id: 441258766
# mas 'Markoff', id: 1084713122
# mas 'Tweetbot', id: 557168941
