# cask_args appdir: '~/Applications'

tap '1password/tap'
tap 'buo/cask-upgrade'

# setup.
brew 'dockutil'
brew 'mas'

# essential command line tools.
brew 'ack'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'htop'
brew 'make'
brew 'tldr'
brew 'tree'
brew 'wget'

# git and github.
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'gist'
brew 'hub'
brew 'copilot-cli'

# development tools.
brew 'codex'
brew 'gitmoji'
brew 'nano'
brew 'node'
brew 'pnpm'
brew 'pyenv'
brew 'swift'
brew 'terraform'
brew 'watchman'
brew 'yarn', args: ["ignore-dependencies"]

# shells and terminal.
brew 'autojump'
brew 'fish'
brew 'starship'
brew 'terminal-notifier'
brew 'thefuck'

# security.
brew 'dnscrypt-proxy'
brew 'gnupg'
brew 'gpg2'
brew 'openssl'

# cloud and network.
brew 'awscli'
brew 'wifi-password'

cask '1password'
cask '1password-cli'
# cask 'abstract'
cask 'automounterhelper'
cask 'copilot-for-xcode'
# cask 'diffmerge'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'gpg-suite'
cask 'google-chrome'
cask 'google-drive'
cask 'iina'
cask 'iterm2'
cask 'keka'
cask 'logitech-options'
cask 'micro-snitch'
cask 'microsoft-edge'
cask 'pocket-casts'
cask 'postman'
cask 'rectangle'
# cask 'rocket'
cask 'slack'
# cask 'tripmode'
cask 'visual-studio-code'
# cask 'zeplin'
cask 'zoom'

# fonts.
cask 'font-fira-code'
cask 'font-monaspace'
cask 'font-open-sans'
cask 'font-roboto-mono'
cask 'font-source-code-pro'

# quicklook.
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'suspicious-package'

# app store.
mas '1Password for Safari', id: 1569813296
mas 'CARROT Weather', id: 993487541
mas 'Encrypto', id: 935235287
mas 'Fantastical', id: 975937182
mas 'Hidden Bar', id: 1452453066
# mas 'iA Writer', id: 775737590
mas 'Kaleidoscope', id: 587512244
mas 'NordVPN', id: 905953485
mas 'Pixelmator Pro', id: 1289583905

# software for home computers.
# cask 'discord'
# cask 'macs-fan-control'
# cask 'plex'
# cask 'steam'
# mas 'AutoMounter', id: 1160435653
# mas 'Panels - Comic Reader', id: 1236567663
